УТ_для_edt.РасширениеСмарт/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияЗаказовКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>СуммаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/СостоянияЗаказовКлиентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("ОтразитьСостояниеЗаказа")
Процедура смарт_ОтразитьСостояниеЗаказа(Заказы, Отказ, УдалениеПроведения, Очередь)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Заказы) = Тип("Массив") Тогда
		МассивСсылок = Заказы;
	ИначеЕсли ОбщегоНазначения.ЗначениеСсылочногоТипа(Заказы) Тогда
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(Заказы);
	Иначе
		
		МассивСсылок = Новый Массив();
		Если Заказы.ДополнительныеСвойства.Свойство("МассивЗависимыхЗаказовКлиентов") Тогда
			МассивСсылок = Новый Массив(Заказы.ДополнительныеСвойства.МассивЗависимыхЗаказовКлиентов);
		КонецЕсли;
		// При записи документов, если в них указаны назначения, документы проводятся по РН: Обеспечение заказов.
		// В наборе записей регистра формируется доп. свойство "ДляЗаписиПодчиненныхДанных" содержащее массив записанных заказов.
		// Этими заказами необходимо дополнить массив ссылок для расчета состояний.
		РегистрыНакопления.ОбеспечениеЗаказов.ДобавитьЗаказыИзНазначений(МассивСсылок, Заказы);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МассивСсылок) Тогда
		Возврат;
	КонецЕсли;
	
	Если УдалениеПроведения Тогда
		
		Для Каждого СтрокаСсылка Из МассивСсылок Цикл
			Набор = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьНаборЗаписей();
			Набор.Отбор.Заказ.Установить(СтрокаСсылка);
			Набор.Записать(Истина);
		КонецЦикла;
		
		Возврат
		
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Заказ, Состояние, ДатаСобытия,
		|СуммаОплаты, ПроцентОплаты, СуммаОтгрузки, ПроцентОтгрузки, СуммаДолга, ПроцентДолга, ЕстьРасхожденияОрдерНакладная");
	
	ТаблицаСостоянийЗаказов = ТаблицаСостоянийЗаказов(МассивСсылок);
	ТаблицаПредыдущихСостоянийЗаказов = ТаблицаПредыдущихСостоянийЗаказов(МассивСсылок);
	
	#Вставка
	//++ #1650 смарт: Шляпников 17.09.2024 / Отметка "Оригиналы документов получены" (Заказ клиента) при частичной отгрузке (1650)
	ТаблицаПодписанныхОтгрузочныхДокументов = ПолучитьТаблицуПодписанныхОтгруженныхДокументов(ТаблицаСостоянийЗаказов);
	//-- #1650 смарт: Шляпников 17.09.2024

	//++ #Б-1634 смарт: Лопато 10.12.2024 //Интеграция с ROIStat. Доработать регистр состояний Интересов. Оплата заказа  
	ТаблицаСостоянийИнтересовЗаказовRoistat = смартИнтеграцияRoistat.ПолучитьСостоянияИнтересовЗаказовRoistat(МассивСсылок);
	//-- #Б-1634 смарт: Лопато 10.12.2024
	#КонецВставки
	
	Для Каждого СтрокаТаблицы Из ТаблицаСостоянийЗаказов Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
		
		#Вставка
		//++ #1650 смарт: Шляпников 17.09.2024 / Отметка "Оригиналы документов получены" (Заказ клиента) при частичной отгрузке (1650)
		СтруктураПоиска.Вставить("смартДокументыПодписаны", Ложь);
		НайденныеСтрокиЗаказов = ТаблицаПодписанныхОтгрузочныхДокументов.НайтиСтроки(Новый Структура("ЗаказКлиента", СтрокаТаблицы.Заказ));
		Если НайденныеСтрокиЗаказов.Количество() > 0 Тогда
			Если НайденныеСтрокиЗаказов[0].ВсеДокументыПодписаны = 1 Тогда
				СтруктураПоиска.Вставить("смартДокументыПодписаны", Истина);
			КонецЕсли;
		КонецЕсли;
		//-- #1650 смарт: Шляпников 17.09.2024
		
		//++ #Б674 смарт: Шляпников 25.03.2025 / Отчет по кол-ву платных доставок, ИТСМ 1959
		ДанныеДоставки = Неопределено;
		Если ТипЗнч(СтрокаТаблицы.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") И ЗначениеЗаполнено(СтрокаТаблицы.Заказ) Тогда
			ДанныеДоставки = РегистрыСведений.смартТарифыНаДоставку.ПроверитьПравильностьРасчетаДоставкиПоЗаказу(СтрокаТаблицы.Заказ);
			Для каждого стрРеквизит Из ДанныеДоставки Цикл
				
				Если стрРеквизит.Ключ = "ДополнительныеДанные" Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураПоиска.Вставить(стрРеквизит.Ключ, стрРеквизит.Значение);
				
			КонецЦикла;
		КонецЕсли;
		//-- #Б674 смарт: Шляпников 25.03.2025
		#КонецВставки
		
		МассивДействующихСостояний = ТаблицаПредыдущихСостоянийЗаказов.НайтиСтроки(СтруктураПоиска);
		
		СостояниеИзменено = НЕ Булево(МассивДействующихСостояний.Количество());
		Если СостояниеИзменено Тогда
			
			Набор = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьНаборЗаписей();
			Набор.Отбор.Заказ.Установить(СтрокаТаблицы.Заказ);
			
			СтрокаНабора = Набор.Добавить();
			
			ОкруглитьПроценты(СтрокаТаблицы.ПроцентОтгрузки);
			ОкруглитьПроценты(СтрокаТаблицы.ПроцентОплаты);
			ОкруглитьПроценты(СтрокаТаблицы.ПроцентДолга);
			
			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаТаблицы);
			
			#Вставка
			//++ #1650 смарт: Шляпников 17.09.2024 / Отметка "Оригиналы документов получены" (Заказ клиента) при частичной отгрузке (1650)
			СтрокаНабора.смартДокументыПодписаны = СтруктураПоиска.смартДокументыПодписаны;
			
			Если ТипЗнч(СтрокаТаблицы.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") И НЕ СтрокаТаблицы.Заказ.смартДокументыПодписаны = СтруктураПоиска.смартДокументыПодписаны Тогда
				ЗаказОбъект = СтрокаТаблицы.Заказ.ПолучитьОбъект();
				ЗаказОбъект.ОбменДанными.Загрузка = Истина;
				ЗаказОбъект.смартДокументыПодписаны = СтруктураПоиска.смартДокументыПодписаны;
				ЗаказОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
				ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			//-- #1650 смарт: Шляпников 17.09.2024
			
			//++ #Б674 смарт: Шляпников 25.03.2025 / Отчет по кол-ву платных доставок, ИТСМ 1959
			Если НЕ ДанныеДоставки = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаНабора, ДанныеДоставки);
			КонецЕсли;
			//-- #Б674 смарт: Шляпников 25.03.202
			
			//++ #Б-1634 смарт: Лопато 10.12.2024 //Интеграция с ROIStat. Доработать регистр состояний Интересов. Оплата заказа  
			МассивСостоянийИнтересовЗаказовRoistat 
				= ТаблицаСостоянийИнтересовЗаказовRoistat.НайтиСтроки(Новый Структура("Заказ", СтрокаТаблицы.Заказ));
			
			Если МассивСостоянийИнтересовЗаказовRoistat.Количество() > 0 Тогда

				РассчитыватьСтатусRoistat = Истина;
				
				МассивПредыдущихСостоянийЗаказов 
					= ТаблицаПредыдущихСостоянийЗаказов.НайтиСтроки(Новый Структура("Заказ", СтрокаТаблицы.Заказ));
				
				Если МассивПредыдущихСостоянийЗаказов.Количество() > 0 Тогда

					//Если процент оплаты не изменился
					Если СтрокаТаблицы.ПроцентОплаты = МассивПредыдущихСостоянийЗаказов[0].ПроцентОплаты Тогда
						РассчитыватьСтатусRoistat = Ложь;
					КонецЕсли;	

				Иначе
					
					//Если нет оплаты
					Если СтрокаТаблицы.ПроцентОплаты = 0 Тогда
						РассчитыватьСтатусRoistat = Ложь;
					КонецЕсли;	

				КонецЕсли;
				
			Иначе	
				
				РассчитыватьСтатусRoistat = Ложь;
	
			КонецЕсли;	
			//-- #Б-1634 смарт: Лопато 10.12.2024
			#КонецВставки
			
			Попытка
				Если Очередь <> Неопределено Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
				Иначе
					Набор.Записать(Истина);
				КонецЕсли;
			Исключение
				Если ТипЗнч(СтрокаТаблицы.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
					ТекстСообщения = НСтр("ru = 'Не удалось отразить состояние заказа клиента: %Ссылка% по причине: %Причина%'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", СтрокаТаблицы.Заказ);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
					ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
						Метаданные.Документы.ЗаказКлиента, СтрокаТаблицы.Заказ, ТекстСообщения);
				ИначеЕсли ТипЗнч(СтрокаТаблицы.Заказ) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
					ТекстСообщения = НСтр("ru = 'Не удалось отразить состояние заявки на возврат: %Ссылка% по причине: %Причина%'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", СтрокаТаблицы.Заказ);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
					ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
						Метаданные.Документы.ЗаявкаНаВозвратТоваровОтКлиента, СтрокаТаблицы.Заказ, ТекстСообщения);
				КонецЕсли;
			КонецПопытки;
			
			#Вставка
			//++ #Б-1634 смарт: Лопато 10.12.2024 //Интеграция с ROIStat. Доработать регистр состояний Интересов. Оплата заказа  
			Если РассчитыватьСтатусRoistat Тогда
				смартИнтеграцияRoistat.ОбновитьЗаписьСостояниеИнтереса(МассивСостоянийИнтересовЗаказовRoistat[0]);
			КонецЕсли;
			//-- #Б-1634 смарт: Лопато 10.12.2024
			
			//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. 
			смартАкцииИСкидки.СформироватьДвиженияИспользованныхТоваровПоЗаказуКлиента(СтрокаТаблицы.Заказ, Отказ);
			//-- #Б4818 смарт: Шляпников 17.11.2025
			#КонецВставки
			
		Иначе
			Если Очередь <> Неопределено Тогда
				
				Набор = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьНаборЗаписей();
				Набор.Отбор.Заказ.Установить(СтрокаТаблицы.Заказ);
				
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Набор);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	#Вставка
	//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.  
	Если Отказ ИЛИ НЕ Константы.смартЗаказыСтатусНаСайтБитрикс.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Заказы) = Тип("Массив") Тогда
		МассивСсылок = Заказы;
	ИначеЕсли ОбщегоНазначения.ЗначениеСсылочногоТипа(Заказы) Тогда
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(Заказы);
	Иначе
		
		МассивСсылок = Новый Массив();
		Если Заказы.ДополнительныеСвойства.Свойство("МассивЗависимыхЗаказовКлиентов") Тогда
			МассивСсылок = Новый Массив(Заказы.ДополнительныеСвойства.МассивЗависимыхЗаказовКлиентов);
		КонецЕсли;
		// При записи документов, если в них указаны назначения, документы проводятся по РН: Обеспечение заказов.
		// В наборе записей регистра формируется доп. свойство "ДляЗаписиПодчиненныхДанных" содержащее массив записанных заказов.
		// Этими заказами необходимо дополнить массив ссылок для расчета состояний.
		РегистрыНакопления.ОбеспечениеЗаказов.ДобавитьЗаказыИзНазначений(МассивСсылок, Заказы);
		
	КонецЕсли;

	Если Не ЗначениеЗаполнено(МассивСсылок) Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаказы = Новый Массив;

	Для Каждого ЭлементЗаказ Из МассивСсылок Цикл
		
		Если ТипЗнч(ЭлементЗаказ) = Тип("ДокументСсылка.ЗаказКлиента") 
			И Б_ОбменССайтомСервер.смартПроверкаЗаказНужноВыгружатьНаСайт(ЭлементЗаказ, Истина) Тогда
			
			МассивЗаказы.Добавить(ЭлементЗаказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДействийРасчета = Новый Структура;
	СтруктураДействийРасчета.Вставить("Заказ");
	СтруктураДействийРасчета.Вставить("УдалениеПроведения", УдалениеПроведения);

	смарт_РаботаССтатусамиЗаказа.смартРассчитатьПараметрыСтатусовЗаказовБитрикс(МассивЗаказы, СтруктураДействийРасчета);
	//--#1241 смарт: Лопато 25.01.2023
	#КонецВставки
	
КонецПроцедуры

//++ #1650 смарт: Шляпников 17.09.2024 / Отметка "Оригиналы документов получены" (Заказ клиента) при частичной отгрузке (1650)
&ИзменениеИКонтроль("ТаблицаПредыдущихСостоянийЗаказов")
Функция смарт_ТаблицаПредыдущихСостоянийЗаказов(МассивСсылок)

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СостоянияЗаказовКлиентов.Заказ КАК Заказ,
	|	СостоянияЗаказовКлиентов.Состояние КАК Состояние,
	|	СостоянияЗаказовКлиентов.ДатаСобытия КАК ДатаСобытия,
	|	СостоянияЗаказовКлиентов.СуммаОплаты КАК СуммаОплаты,
	|	СостоянияЗаказовКлиентов.ПроцентОплаты КАК ПроцентОплаты,
	|	СостоянияЗаказовКлиентов.СуммаОтгрузки КАК СуммаОтгрузки,
	|	СостоянияЗаказовКлиентов.ПроцентОтгрузки КАК ПроцентОтгрузки,
	|	СостоянияЗаказовКлиентов.СуммаДолга КАК СуммаДолга,
	|	СостоянияЗаказовКлиентов.ПроцентДолга КАК ПроцентДолга,
	|	СостоянияЗаказовКлиентов.ЕстьРасхожденияОрдерНакладная КАК ЕстьРасхожденияОрдерНакладная
	#Вставка
	//++ #1650 смарт: Шляпников 17.09.2024 / Отметка "Оригиналы документов получены" (Заказ клиента) при частичной отгрузке (1650)
	|	,СостоянияЗаказовКлиентов.смартДокументыПодписаны КАК смартДокументыПодписаны,
	//-- #1650 смарт: Шляпников 17.09.2024
	//++ #Б674 смарт: Шляпников 25.03.2025 / Отчет по кол-ву платных доставок, ИТСМ 1959
	|	СостоянияЗаказовКлиентов.смартНаценкаПоДоставкеРассчитана КАК смартНаценкаПоДоставкеРассчитана,
	|	СостоянияЗаказовКлиентов.смартНаценкаПоДоставке КАК смартНаценкаПоДоставке,
	|	СостоянияЗаказовКлиентов.смартНаценкаПоДоставкеСумма КАК смартНаценкаПоДоставкеСумма,
	|	СостоянияЗаказовКлиентов.смартНаценкаПоДоставкеРассчитанаСОшибкой КАК смартНаценкаПоДоставкеРассчитанаСОшибкой,
	|	СостоянияЗаказовКлиентов.смартНаценкаПоДоставкеОписаниеОшибки КАК смартНаценкаПоДоставкеОписаниеОшибки,
	|	СостоянияЗаказовКлиентов.смартНаценкаПоДоставкеПоТарифу КАК смартНаценкаПоДоставкеПоТарифу,
	|	СостоянияЗаказовКлиентов.смартНаценкаПоДоставкеСуммаПоТарифу КАК смартНаценкаПоДоставкеСуммаПоТарифу
	//-- #Б674 смарт: Шляпников 25.03.2025
	#КонецВставки
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|ГДЕ
	|	СостоянияЗаказовКлиентов.Заказ В(&МассивСсылок)");

	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
//-- #1650 смарт: Шляпников 17.09.2024

#КонецОбласти

#Область ДоработкиСмарт

//++ #1650 смарт: Шляпников 17.09.2024 / Отметка "Оригиналы документов получены" (Заказ клиента) при частичной отгрузке (1650)
Функция ПолучитьТаблицуПодписанныхОтгруженныхДокументов(ТаблицаСостоянийЗаказов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Заказ КАК Заказ,
	|	Т.ПроцентОтгрузки КАК ПроцентОтгрузки
	|ПОМЕСТИТЬ ВТЗаказы
	|ИЗ
	|	&ТЗ КАК Т
	|ГДЕ
	//++ #Б-6124 смарт: Фролов 19.03.2026 //Заказ клиента. Установка признака Оригиналы документов подписаны.
	//|	Т.ПроцентОтгрузки = 100
	|	Т.ПроцентОтгрузки >= 100
	//-- #Б-6124 смарт: Фролов 19.03.2026
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыКлиентовОбороты.ЗаказКлиента КАК ЗаказКлиента,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(Подписан.Значение, ЛОЖЬ) = ИСТИНА
	|				ТОГДА 1
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(РаботаПоДокументамПроведена.Значение, ЛОЖЬ) = ИСТИНА
	|						ТОГДА 1
	|					ИНАЧЕ 0 
	|				КОНЕЦ
	//++ #5368 смарт: Тимофеева 15.01.26 / Включить закрытие заказа только по галочке Документ подписан
	//|			ИНАЧЕ ВЫБОР
	//|					КОГДА ЕСТЬNULL(ПодписанТН.Значение, ЛОЖЬ) = ИСТИНА
	//|						ТОГДА 1
	//|					ИНАЧЕ 0
	//|				КОНЕЦ
	//|			ИНАЧЕ 0
	//-- #5368 смарт: Тимофеева 15.01.26
	|		КОНЕЦ) КАК ВсеДокументыПодписаны
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ЗаказКлиента В
	|				(ВЫБРАТЬ
	|					Т.Заказ
	|				ИЗ
	|					ВТЗаказы КАК Т)) КАК ЗаказыКлиентовОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК Подписан
	|		ПО ЗаказыКлиентовОбороты.Регистратор = Подписан.Объект
	|			И (Подписан.Свойство.Имя = ""Подписан"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК РаботаПоДокументамПроведена
	|		ПО ЗаказыКлиентовОбороты.Регистратор = РаботаПоДокументамПроведена.Объект
	|			И (РаботаПоДокументамПроведена.Свойство.Имя = ""смартРаботаПоДокументамПроведена"")
	//++ #5368 смарт: Тимофеева 15.01.26 / Включить закрытие заказа только по галочке Документ подписан
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ПодписанТН
	//|		ПО ЗаказыКлиентовОбороты.Регистратор = ПодписанТН.Объект
	//|			И (ПодписанТН.Свойство.Имя = ""ПодписанаТН"") 
	//-- #5368 смарт: Тимофеева 15.01.26
	|ГДЕ
	|	(ЗаказыКлиентовОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ИЛИ ЗаказыКлиентовОбороты.Регистратор ССЫЛКА Документ.АктВыполненныхРабот)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыКлиентовОбороты.ЗаказКлиента";
	Запрос.УстановитьПараметр("ТЗ", ТаблицаСостоянийЗаказов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти


#КонецЕсли
